from utils import * 

def Main():
    """메인 모델"""
    run = True
    while run:
        Utils.Borderline()
        print("안녕하세요 텍정처 에브리타임 리뷰 키워드 프로젝트 입니다.")
        print("어떤 것을 확인하시겠습니까?")
        print("1. 강의 목록 확인하기")
        print("2. 강의 정보 검색하기")
        print("3. 종료하기")
        menu = input(":")
        while menu not in ["1", "2", "3"]:
            print("잘못된 입력입니다.")
            menu = input(":")

        Utils.Borderline()

        # 강의 목록
        if menu == "1":
            """카테고리 : [(해당 강의명, 교수명)]"""
            lecture_info = {
    '문학과예술':[('영화의이해','김동호'),('음악사','지형주'),('디자인과문화','김혜란')],
    '인간과역사':[('현대사회와심리학','윤소연'),('이상행동의심리','양현정')], 
    '가치와 윤리': [('철학과윤리', '고정식'), ('행복의 과학', '서은국'), ('문명과질병', '박돈하')],
    '국가와 사회': [('재산거래와법', '신정민'), ('헌법의이해', '이승현'), ('범죄와형벌', '심희기')],
    '지역사회와세계':[('국제사회와법이야기','박덕영'),('현대사회와경제','조하현'),('세계평화와발전의국제관계','배종윤')],
    '논리와수리':[('수학과금융사회','김정훈'),('빅데이터와지식탐사','이원석')],
    '자연과우주':[('우주의이해','정애리'),('기후와문명','노의근')],
    '생명과환경':[('건강과운동','백일영'),('활과리라','김응빈'),('인간의삶과역사속의미생물','이주헌')],
    '정보와기술':[('융합시대의디지털멀티미디어','윤대희'),('디지털방송의진화','서종수'),('인공지능의이해와활용','손의성')]
}
            for k, v in lecture_info.items():
                print(k, ' : ', v)
            

        # 강의 정보
        elif menu == "2":
            lecture_name = input("확인하실 강의 이름을 입력해주세요 (띄어쓰기 구분 X) : ")
            
            lecture = Utils.name_check(lecture_name)
            while lecture == "unmatch":
                lecture_name = input("확인하실 강의 이름을 입력해주세요 (띄어쓰기 구분 X) : ")
                lecture = Utils.name_check(lecture_name)

            menu = Analysis_Review(lecture).script()
        
            
            


        elif menu == "3":
            print("모델을 종료합니다.")
            run = False

        else:
            print("잘못된 입력입니다.")







########################################################################################################
########################################################################################################

Main()
